app/controllers/bank_transfer_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "29eabcd0dc33357aef653e2527ce3c4b"], ["LIMIT", 1]]
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."user_id" = ? ORDER BY "bank_accounts"."id" ASC  [["user_id", 1]]
---
  def index
    user_id = User.find_by_session_id(cookies[:session_id]).id
    @banks = BankAccount.where(user_id: user_id).order(:id)

SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "29eabcd0dc33357aef653e2527ce3c4b"], ["LIMIT", 1]]
UPDATE "users" SET "money" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["money", 123369.0], ["updated_at", 2017-02-24 01:47:30 UTC], ["id", 1]]
---
  def create
    user = User.find_by_session_id(cookies[:session_id])
    if params[:bank_id]
      if params[:transfer_type] == 'deposit'
        if params[:withdrawal_amount].to_f < user.money
          user.money -= params[:withdrawal_amount].to_f
          user.save