app/controllers/banks_controller.rb

  def index
    user_id = Users.find_by_session_id(cookies[:session_id]).id
    @banks = BankAccounts.where(user_id: user_id).order(:id)
---
SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "16afbf4f2952ffc47c0cf0665083ea32"], ["LIMIT", 1]]
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."user_id" = ? ORDER BY "bank_accounts"."id" ASC  [["user_id", 1]]

  def create
    user_id = Users.find_by_session_id(cookies[:session_id]).id
    BankAccounts.create(user_id: user_id, bank_name: params[:bank_name], account_number: params[:account_number], routing_number: params[:routing_number])
---
SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "16afbf4f2952ffc47c0cf0665083ea32"], ["LIMIT", 1]]
INSERT INTO "bank_accounts" ("user_id", "bank_name", "account_number", "routing_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["bank_name", "sdf"], ["account_number", "erg"], ["routing_number", "wreg"], ["created_at", 2017-02-21 19:40:26 UTC], ["updated_at", 2017-02-21 19:40:26 UTC]]

  def destroy
    user_id = Users.find_by_session_id(cookies[:session_id]).id
    bank = BankAccounts.find_by(id: params[:id], user_id: user_id)
    if bank
      bank.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "bd398aeac6c2fb1810e27dce9a8c84e3"], ["LIMIT", 1]]
SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = ? AND "bank_accounts"."user_id" = ? LIMIT ?  [["id", 6], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "bank_accounts" WHERE "bank_accounts"."id" = ?  [["id", 2]]