app/controllers/create_account_controller.rb

INSERT INTO "users" ("session_id", "email", "first_name", "last_name", "password", "money", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    ses_id = SecureRandom.hex(16)
    User.create(session_id: ses_id, email:  params[:email], first_name:  params[:first_name],last_name:  params[:last_name], password:  params[:password],money:  0)