app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "asd"], ["password", "asd"], ["LIMIT", 1]]
UPDATE "users" SET "session_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_id", "16afbf4f2952ffc47c0cf0665083ea32"], ["updated_at", 2017-02-21 19:18:09 UTC], ["id", 1]]
---
  def index
    if cookies[:session_id] #session is valid
      redirect_to '/'
      return
    end

    if params[:email] && params[:password] #logging in with params in header
     user = Users.find_by(email: params[:email] , password: params[:password] )
     if user
       ses_id = SecureRandom.hex(16)
       user.session_id = ses_id
       user.save