app/controllers/make_transfer_controller.rb

  def index
    #in correct get request to make a transfer
    user =  User.find_by_session_id(cookies[:session_id])
    reciever = User.find_by_email(params[:email])
    if reciever
      if params[:transfer_type] == "send"
        if user.money > params[:amount].to_f
          user.sent_transactions.create(recipient_id: reciever.id, amount: params[:amount], message: params[:message])

          reciever.money = reciever.money + params[:amount].to_f
          reciever.save

          user.money = user.money - params[:amount].to_f.round(2)
          user.save


          redirect_to '/transfer', :flash => { :message => "Funds Successfully Sent" }
        else
          redirect_to '/transfer', :flash => { :error => "Insufficient Funds" }
        end
      else
        user.sent_requests.create(recipient_id: reciever.id, amount: params[:amount], message: params[:message])
---
SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "021b7575be8ad920a7aa307cee861293"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "wef"], ["LIMIT", 1]]
INSERT INTO "transactions" ("sender_id", "amount", "fulfilled", "message", "created_at", "updated_at", "requested_email") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sender_id", 1], ["amount", 123.0], ["fulfilled", false], ["message", "asd"], ["created_at", 2017-02-23 20:12:50 UTC], ["updated_at", 2017-02-23 20:12:50 UTC], ["requested_email", "asd"]]
UPDATE "users" SET "money" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["money", -123.0], ["updated_at", 2017-02-23 22:29:48 UTC], ["id", 2]]
INSERT INTO "requests" ("sender_id", "recipient_id", "amount", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sender_id", 2], ["recipient_id", 1], ["amount", 34.0], ["message", "tert"], ["created_at", 2017-02-23 22:30:55 UTC], ["updated_at", 2017-02-23 22:30:55 UTC]]