app/controllers/profile_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "ddd0ff90ad2288860ec45c80242b5ab9"], ["LIMIT", 1]]
---
  def index
    @user = Users.find_by_session_id(cookies[:session_id])