app/controllers/requests_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "021b7575be8ad920a7aa307cee861293"], ["LIMIT", 1]]
---
  def index
    user =  User.find_by_session_id(cookies[:session_id])

SELECT  "users".* FROM "users" WHERE "users"."session_id" = ? LIMIT ?  [["session_id", "66ef551a83cac0bddcb95f3be18b6bba"], ["LIMIT", 1]]
---
  def create
    user =  User.find_by_session_id(cookies[:session_id])